dataset_gen/Flowbench_Openfoam/FPO_External/Hole_Location/Design_Point_0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            patch;
        nFaces          256;
        startFace       130016;
    }
    right
    {
        type            patch;
        nFaces          256;
        startFace       130272;
    }
    bottom
    {
        type            patch;
        nFaces          256;
        startFace       130528;
    }
    top
    {
        type            patch;
        nFaces          256;
        startFace       130784;
    }
    hole
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          64;
        startFace       131040;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          130560;
        startFace       131104;
    }
)

// ************************************************************************* //
