dataset_gen/Flowbench_Openfoam/FPO_External/Hole_Location/Design_Point_0/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

vertices
(
    // ---- z=0 plane ----
    (0         0         0)    // v0
    (30    0         0)    // v1
    (34    0         0)    // v6
    (64         0         0)    // v3

    (0         30    0)    // v4
    (30    30    0)    // v5
    (34    30    0)    // v6
    (64         30    0)    // v7

    (0         34    0)    // v8
    (30    34    0)    // v9
    (34    34    0)    // v10
    (64         34    0)    // v11

    (0         64         0)    // v164
    (30    64         0)    // v13
    (34    64         0)    // v14
    (64         64         0)    // v15

    // ---- z=0.1 plane ----
    (0         0         0.1)  // v16
    (30    0         0.1)  // v17
    (34    0         0.1)  // v18
    (64         0         0.1)  // v19

    (0         30    0.1)  // v20
    (30    30    0.1)  // v21
    (34    30    0.1)  // v22
    (64         30    0.1)  // v23

    (0         34    0.1)  // v24
    (30    34    0.1)  // v25
    (34    34    0.1)  // v26
    (64         34    0.1)  // v27

    (0         64         0.1)  // v28
    (30    64         0.1)  // v29
    (34    64         0.1)  // v30
    (64         64         0.1)  // v31
);

// -----------------------------------------------------------------------------
// 2. BLOCKS
//    8 blocks around the hole. The hole in the center is not meshed at all.
//    That yields 128×128 - 8×8 = 16320 cells total.
// -----------------------------------------------------------------------------

blocks
(
    // Bottom-left
    hex (0 1 5 4 16 17 21 20) (120 120 1) simpleGrading (1 1 1)

    // Bottom-center
    hex (1 2 6 5 17 18 22 21) (16 120 1) simpleGrading (1 1 1)

    // Bottom-right
    hex (2 3 7 6 18 19 23 22) (120 120 1) simpleGrading (1 1 1)

    // Middle-left
    hex (4 5 9 8 20 21 25 24) (120 16 1) simpleGrading (1 1 1)

    // Middle-right
    hex (6 7 11 10 22 23 27 26) (120 16 1) simpleGrading (1 1 1)

    // Top-left
    hex (8 9 13 12 24 25 29 28) (120 120 1) simpleGrading (1 1 1)

    // Top-center
    hex (9 10 14 13 25 26 30 29) (16 120 1) simpleGrading (1 1 1)

    // Top-right
    hex (10 11 15 14 26 27 31 30) (120 120 1) simpleGrading (1 1 1)
);



edges
(
    // none
);

// -----------------------------------------------------------------------------
// 3. BOUNDARIES
//    We define 6 patches:
//      - left, right, bottom, top: outer edges
//      - hole: the ring of newly-exposed faces around the omitted center
//      - frontAndBack: z=0 & z=0.1 planes (empty for 2D)
// -----------------------------------------------------------------------------

boundary
(
    // -------------------------------
    // (A) LEFT boundary (x=0)
    //    from bottom-left, middle-left, top-left blocks
    left
    {
        type    patch;
        faces
        (
            // bottom-left block left side: (0 4 20 16)
            (0 4 20 16)

            // middle-left block left side: (4 8 24 20)
            (4 8 24 20)

            // top-left block left side: (8 12 28 24)
            (8 12 28 24)
        );
    }

    // -------------------------------
    // (B) RIGHT boundary (x=1)
    //    from bottom-right, middle-right, top-right blocks
    right
    {
        type    patch;  
        faces
        (
            // bottom-right block face: (3 7 23 19)
            (3 7 23 19)

            // middle-right block face: (7 11 27 23)
            (7 11 27 23)

            // top-right block face: (11 15 31 27)
            (11 15 31 27)
        );
    }

    // -------------------------------
    // (C) BOTTOM boundary (y=0)
    //    from bottom-left, bottom-center, bottom-right blocks
    bottom
    {
        type    patch;  
        faces
        (
            // bottom-left block bottom side: (0 1 17 16)
            (0 1 17 16)

            // bottom-center block bottom side: (1 2 18 17)
            (1 2 18 17)

            // bottom-right block bottom side: (2 3 19 18)
            (2 3 19 18)
        );
    }

    // -------------------------------
    // (D) TOP boundary (y=1)
    //    from top-left, top-center, top-right blocks
    top
    {
        type    patch;  
        faces
        (
            // top-left block top side: (12 13 29 28)
            (12 13 29 28)

            // top-center block top side: (13 14 30 29)
            (13 14 30 29)

            // top-right block top side: (14 15 31 30)
            (14 15 31 30)
        );
    }

    // -------------------------------
    // (E) HOLE boundary (inner ring)
    //    4 newly-exposed faces that border the missing center block
    hole
    {
        type    wall;  // no-slip wall
        faces
        (
            // bottom-center block top edge: (5 6 22 21)
            (5 6 22 21)

            // middle-left block right edge: (5 9 25 21)
            (5 9 25 21)

            // middle-right block left edge: (6 10 26 22)
            (6 10 26 22)

            // top-center block bottom edge: (9 10 26 25)
            (9 10 26 25)
        );
    }

    // -------------------------------
    // (F) FRONT-AND-BACK boundary
    //    The planes z=0 and z=0.1 for each block, marked 'empty' for a 2D mesh.
    //
    //    Each block has 2 faces in z=0, z=0.1. We'll list them all in correct
    //    vertex order to avoid "no neighbor cell" errors.
    frontAndBack
    {
        type    empty;
        faces
        (
            // bottom-left block
            (0 1 5 4)
            (16 20 21 17)

            // bottom-center block
            (1 2 6 5)
            (17 21 22 18)

            // bottom-right block
            (2 3 7 6)
            (18 22 23 19)

            // middle-left block
            (4 5 9 8)
            (20 24 25 21)

            // middle-right block
            (6 7 11 10)
            (22 26 27 23)

            // top-left block
            (8 9 13 12)
            (24 28 29 25)

            // top-center block
            (9 10 14 13)
            (25 29 30 26)

            // top-right block
            (10 11 15 14)
            (26 30 31 27)
        );
    }
);

mergePatchPairs();
